In [1]:
import numpy as np
import pandas as pd

In [2]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [3]:
df = pd.DataFrame(d)

In [4]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [7]:
df.dropna() #by default the axis is 0 and so the method works on the rows
            #drops any row with NaN value

     A    B  C
0  1.0  5.0  1

In [8]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [9]:
df.dropna(axis = 1 ) #now it drops the columns that have NaN values

   C
0  1
1  2
2  3

In [13]:
df.dropna(thresh = 2) #thresh = 2 says that if there is 2 non NaN values in the row then keep that row

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [14]:
df.dropna(thresh = 1) #so only drop the row if all values are NaN in this case.
                      #without thresh if there is an NaN value in the row, regardless of how many non NaN values there
                      #are the row will be dropped

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [15]:
df.fillna(value = 'Fill Value')

            A           B  C
0           1           5  1
1           2  Fill Value  2
2  Fill Value  Fill Value  3

In [16]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64